In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker

In [2]:
data=pd.read_csv('../raw_data/states_all.csv')
data.head()

   Year Jurisdiction  All students Average scale score
0  2022     National  All students                 236
1  2022      Alabama  All students                 230
2  2022       Alaska  All students                 226
3  2022      Arizona  All students                 232
4  2022     Arkansas  All students                 228

In [3]:
## data clean
data.replace('—', np.nan, inplace=True)
data.replace('‡', np.nan, inplace=True)
data['Year'] = pd.to_numeric(data['Year'], errors='coerce')
data.dropna(subset=['Year'], inplace=True)  # Drop rows where 'Year' is NaN
data['Year'] = data['Year'].astype(int)
data['Average scale score'] = pd.to_numeric(data['Average scale score'], errors='coerce')

In [4]:
# only 2000 years later
data = data[data['Year'] > 2000]
data = data[data['Jurisdiction'] != 'DoDEA']
data = data[data['Jurisdiction'] != 'Puerto Rico']
data = data[data['Jurisdiction'] != 'District of Columbia']

In [5]:
data['Year'] = data['Year'].astype(str)

In [6]:
null_exists = data['Average scale score'].isnull().sum()
null_exists

0

In [7]:
data

     Year   Jurisdiction  All students  Average scale score
0    2022       National  All students                236.0
1    2022        Alabama  All students                230.0
2    2022         Alaska  All students                226.0
3    2022        Arizona  All students                232.0
4    2022       Arkansas  All students                228.0
..    ...            ...           ...                  ...
535  2003       Virginia  All students                239.0
536  2003     Washington  All students                238.0
537  2003  West Virginia  All students                231.0
538  2003      Wisconsin  All students                237.0
539  2003        Wyoming  All students                241.0

[510 rows x 4 columns]

In [31]:
data.to_csv('../clean_data/after_clean.csv',index=False)